// Выведите в консоль все целые числа от 1 до 100.
console.log("Целые числа в диапазоне от 1 до 100:");
for (let i = 1; i <= 100; i++) {
  console.log(i);
}
// Выведите в консоль все целые числа от -100 до 0.
console.log("Целые числа в диапазоне от -100 до 0:");
for (let i = -100; i <= 0; i++) {
  console.log(i);
}
// Выведите в консоль все целые числа от 100 до 1.
console.log("Целые числа в диапазоне от 100 до 1:");
for (let i = 100; i >= 1; i--) {
  console.log(i);
}
// Выведите в консоль все четные числа из промежутка от 1 до 100.
console.log("Целые чётные числа в диапазоне от 1 до 100:");
for (let i = 1; i <= 100; i++) {
  if (i % 2 === 0) {
    console.log(i);
  }
}
// Выведите в консоль все числа кратные трем в промежутке от 1 до 100.
console.log("Целые числа, кратные трём, в диапазоне от 1 до 100:");
for (let i = 1; i <= 100; i++) {
  if (i % 3 === 0) {
    console.log(i);
  }
}