console.log("Уровень 3.9 задачника code.me");
console.log("№1: Дана строка. Проверьте, что эта строка состоит только из цифр.");
const string3_9_1 = "531801";
const isNumbersString3_9_1 = [...string3_9_1].filter((el) => +el % 1 === 0).join("");
string3_9_1.length === isNumbersString3_9_1.length ? console.log(`Строка ${string3_9_1} полностью состоит из цифр`) : 
console.log(`В строке ${string3_9_1} содержатся отличные от цифр символы.`);
console.log(
    "**************************************************************************************************"
);
console.log("№2: Дана строка. Проверьте, что эта строка состоит только из четных цифр.");
const string3_9_2 = "62418";
const evenString3_9_2 = [...string3_9_2].filter((el) => +el % 2 === 0).join("");
string3_9_2.length === evenString3_9_2.length ? console.log(`Строка ${string3_9_2} состоит из чётных чисел`) : 
console.log(`В строке ${string3_9_2} есть нечётные числа.`);
console.log(
    "**************************************************************************************************"
);