console.log("Уровень 3.6 задачника code.me");
console.log("Дан массив со числами. Удалите из него числа, состоящие более чем из трех цифр.");
const array3_6_1 = [217, 885, 24, 99, 0.15, -77];
console.log(array3_6_1.filter((elem) => Math.abs(elem).toString().length < 3));
console.log(
    "**************************************************************************************************"
);
console.log("Дано некоторое число:");
console.log("let num = 12345;");
console.log("Проверьте, что все цифры этого числа больше нуля.");
const number3_6_2 = 12345;
console.log([...number3_6_2.toString()].filter((el) => +el > 0));
if (number3_6_2 == [...number3_6_2.toString()].filter((el) => +el > 0).join("")) {
    console.log(`В числе ${number3_6_2} все цифры больше нуля.`)
} else {
    console.log(`В числе ${number3_6_2} есть цифры равные нулю.`)
}
console.log(
    "**************************************************************************************************"
);
console.log("Дан некоторый массив, например, вот такой:");
console.log("[123, 456, 789]");
console.log("Слейте все элементы этого массива в один массив, разбив их посимвольно:");
console.log("[1, 2, 3, 4, 5, 6, 7, 8, 9]");
const array3_6_3 = [123, 456, 789];
